Repository: eldesh/coq_ja_work
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: To ease compatibility with ordinary record types, each primitive projection is also defined as a ordinary constant taking parameters and an object of the record type as arguments, and whose body is an application of the unfolded primitive projection of the same name.
ja: 通常のレコード型との互換性を緩和するため、各プリミティブ射影は通常のパラメータと、引数としてそのレコード型のオブジェクトとを取り、そのボディーが同じ名前の非畳み込みプリミティブ射影の適用であるものとしても定義されます。

source: To ease the parametrization of developments by typeclasses, we provide a new way to introduce variables into section contexts, compatible with the implicit argument mechanism.
ja: 開発のパラメータ化を型クラスによって楽にするため、セクションの文脈に変数を導入する、暗黙引数の機構と互換な新しい方法を提供します。

source: To eliminate the (co-)inductive type, one must use its defined primitive projections.
ja: (余)帰納的型を排除するためには、その定義されたプリミティブ射影を使わなければならない。

source: To explain the notation ``[find v | t1 ~ t2]`` let us pick one of its instances: ``[find e | EQ.obj e ~ T | "is not an EQ.type" ]``.
ja: 記法 ``[find v | t1 ~ t2]`` を説明するため、具体例の一つ ``[find e | EQ.obj e ~ T | "is not an EQ.type" ]`` を取り上げます。

source: To get to an interesting example we need another base class to be available.
ja: 興味深い例を得るにはもう一つの基本クラスを必要とします。

source: To keep the example small, the algebraic structure ``EQ.type`` we are defining is very simplistic, and characterizes terms on which a binary relation is defined, without requiring such relation to validate any property.
ja: 例を小さく保つため、我々が定義する代数構造 ``EQ.type`` は非常に単純でかつ、ある定義された二項関係上で項を特徴づけ、そのような関係に要求されるどんな性質の正当性の立証もありません。

source: To reactivate the high-level printing features, use the command ``Unset Printing All``.
ja: 高レベル表示機能を再度有効化するには、``Unset Printing All`` コマンドを使います。

source: To start using Coq, it is advised to first read a tutorial.
ja: Coqを初めて使う方は、まずチュートリアルを読むことをお勧めします。

source: Turn this option on to activate the display of the actual level of each occurrence of :g:`Type`.
ja: このオプションをオンにすると、出現したそれぞれの :g:`Type` の実際のレベルの表示を有効化します。

source: Turning this option on deactivates all high-level printing features such as coercions, implicit arguments, returned type of pattern matching, notations and various syntactic sugar for pattern matching or record projections.
ja: このオプションを有効にするとコアーション、暗黙引数、パターンマッチングの戻り型、表記法、それにパターンマッチやレコード射影のための様々な糖衣構文などの全ての高レベル表示機能を解除します。

source: Turns on the use of primitive projections when defining subsequent records (even through the ``Inductive`` and ``CoInductive`` commands).
ja: 後続のレコードを (``Inductive`` や ``CoInductive`` コマンドだとしても) 定義するときにプリミティブ射影を有効にします。.

source: Tutorial
ja: チュートリアル

source: Type Classes
ja: 型クラス

source: Typeclass declarations introduced when this option is set have a more efficient resolution behavior (the option is off by default).
ja: このオプションが設定された時に導入された型クラス宣言は、より効率的な解決時の振る舞いを持っています。(このオプションはデフォルトで無効です)。

source: Typeclass declarations introduced when this option is set have a stricter resolution behavior (the option is off by default).
ja: このオプションが設定されたときに導入された型クラス宣言はより厳密な解決時の振る舞いを持ちます。(このオプションはデフォルトで無効です)

source: Typeclasses Transparent, Typclasses Opaque
ja: 透明な型クラス、不透明な型クラス

source: Typeclasses eauto `:=`
ja: 型クラスの eauto `:=`

source: Unfortunately there is still an obstacle to developing the algebraic theory of this new class.
ja: 残念ながら未だにこの新しいクラスの代数理論の開発の障害があります。

source: Unfortunately, these declarations are very verbose.
ja: 残念ながらこれらの定義は非常に冗長です。

source: Use the keyword ``Inductive`` or ``CoInductive`` instead.
ja: 代わりにキーワード ``Inductive`` または ``CoInductive`` を使ってください。

source: Use the :cmd:`Add @table` and :cmd:`Remove @table` commands to update the set of qualids.
ja: qualid の集合を更新するには :cmd:`Add @table` と :cmd:`Remove @table` コマンドを使います。

source: User extensions
ja: ユーザ拡張

source: Using an empty database (created with :cmd:`Create HintDb` for example) with unfoldable variables and constants as the first argument of ``typeclasses eauto`` hence makes resolution with the local hypotheses use full conversion during unification.
ja: 展開可能変数と定数を伴う (例えば :cmd:`Create HintDb` で作成された) 空のデータベースを ``typeclasses eauto`` の最初の引数として使い、従って単一化の間、局所的な仮定を使う解消に完全変換を使わせます。

source: Using the so-called *Curry-Howard isomorphism*, programs, properties and proofs are formalized in the same language called *Calculus of Inductive Constructions*, that is a :math:`\lambda`-calculus with a rich type system.
ja: *カリー・ハワード同型対応* を使えば、プログラム・性質・証明は全て *Calculus of Inductive Constructions* という一つの言語で表現できます。これは :math:`\lambda` 計算にリッチな型システムが付いたものです。

source: Variants:
ja: 類型:

source: Various informations can be found in the following documents:
ja: 以下の文書からも様々な情報を得ることができます。

source: We amend that by equipping ``nat`` with a comparison relation.
ja: これを ``nat`` に比較関係を授けることで修正します。

source: We build an infix notation == for a comparison predicate.
ja: 比較述語のための中置記法 == を構築します。

source: We can now formulate out first theorem on the objects of the ``LEQ`` structure.
ja: 我々は今や ``LEQ`` 構造のオブジェクト上で最初の定理を定式化することが出来ます。

source: We choose the class of types that are equipped with an order relation, to which we associate the infix ``<=`` notation.
ja: 中置 ``<=`` 記法を伴った順序関係を装備した型のクラスを選択します。

source: We describe here extensions of |Gallina|’s syntax.
ja: ここでは |Gallina| の構文の拡張について説明します。

source: We invite the interested reader to refer to this paper for all the details that are omitted here for brevity.
ja: 簡潔さのためにここでは省略した全ての詳細について興味のある読者にはこの論文を参照することを勧めます。

source: We know how to use ``== `` on base types, like ``nat``, ``bool``, ``Z``.
ja: 私たちは ``nat``、``bool``、``Z`` のような基本型上で ``==`` をどのように使うかを知っています。

source: We need some infrastructure for that.
ja: いくらかの基盤が必要です。

source: We need to define a new class that inherits from both ``EQ`` and ``LE``.
ja: ``EQ`` と ``LE`` の両方から派生した新しいクラスを定義する必要があります。

source: We now have all we need to create a compact “packager” to declare instances of the ``LEQ`` class.
ja: 今や我々は ``LEQ`` クラスのインスタンスを定義するためのコンパクトな "荷造り業者" を作るために必要なものを全て持っています。

source: We recommend using the various indexes to quickly locate the documentation you are looking for.
ja: 目的の文書を素早く見つけるために、色々な索引を使うことをお勧めします。

source: We use Coq modules as namespaces.
ja: Coq のモジュールを名前空間として使います。

source: We’ll use the following example class in the rest of the chapter:
ja: この章の残りでは以下の例示クラスを使います。

source: What the user provides is a proof of this statement for ``n`` and ``m`` of type ``nat`` and a proof that the pair constructor preserves this property.
ja: ユーザが提供したものは ``n`` と ``m`` の型 ``nat`` についてのこのステートメントの証明とペアコンストラクタがこの性質を保存するという証明です。

source: When `qualid` denotes a projection, the syntax `term.(qualid)` is equivalent to `qualid term`, the syntax `term.(qualid` |arg_1| |arg_n| `)` to `qualid` |arg_1| `…` |arg_n| `term`, and the syntax `term.(@qualid` |term_1| |term_n| `)` to `@qualid` |term_1| `…` |term_n| `term`.
ja: `qualid` が射影を意味するとき、`term.(qualid)` という構文は `qualid term` と等しく、`term.(qualid` |arg_1| |arg_n| `)` は `qualid` |arg_1| `…` |arg_n| `term` と、`term.(@qualid` |term_1| |term_n| `)` という構文は `@qualid` |term_1| `…` |term_n| `term` と等しくなります。

source: When a solution to the typeclass goal of this class is found, we never backtrack on it, assuming that it is canonical.
ja: このクラスの型クラスゴールの解が見つかったとき、けっしてバックトラックを行わず、それが正準であると仮定します。

source: When a type is declared with primitive projections, its :g:`match` construct is disabled (see :ref:`primitive_projections` though).
ja: ある型がプリミティブ射影によって定義されたとき、その :g:`match` による構成は無効化されます (:ref:`primitive_projections` 参照).

source: When a typeclass resolution is launched we ensure that it has a single solution or fail.
ja: 型クラス解決が起きた時、それが単一の解を持たないならば失敗することを保証します。

source: When called with no arguments, ``typeclasses eauto`` uses the ``typeclass_instances`` database by default (instead of core).
ja: 引数なしで呼ばれたときは、``typeclasses eauto`` はデフォルトで (コアの替わりに) ``typeclass_instances`` データベースを使います。

source: When called with specific databases (e.g. with), ``typeclasses eauto`` allows shelved goals to remain at any point during search and treat typeclass goals like any other.
ja: 特定のデータベース (例. with) を伴って呼ばれたとき、``typeclasses eauto`` は先送りにされたゴールを検索中のどの時点でもとどまることを許し、型クラスゴールを他と同じように扱います。

source: When considering local hypotheses, we use the transparent state of the first hint database given.
ja: 局所的な仮定を考えるとき、我々は与えられた最初のヒントデータベースの透過性状態を使います。

source: When it is off, they fail with an error instead.
ja: 無効なときは、替わりにエラーを伴って失敗します。

source: When it is on (the default), instances that have unsolved holes in their proof-term silently open the proof mode with the remaining obligations to prove.
ja: それが有効 (デフォルト) なとき、証明項に未解決のホールがあるインスタンスは残っている証明課題を伴って証明モードを開きます。

source: When looking for unifications of a goal with an instance of this class, we “freeze” all the existentials appearing in the goals, meaning that they are considered rigid during unification and cannot be instantiated.
ja: このクラスのインスタンスによりゴールの単一化を求めている時、そのゴールに現れる全ての存在量化された変数を "凍結" します。これは単一化の間固定され、インスタンス化できないと見なされることを意味しています。

source: When one calls a class method, a constraint is generated that is satisfied only in contexts where the appropriate instances can be found.
ja: クラスメソッドを呼ぶとき、ある制約が生成され、それは適切なインスタンスが見つかる文脈の中でのみ充足されます。

source: When the :flag:`Primitive Projections` option is on, definitions of record types change meaning.
ja: :flag:`Primitive Projections` オプションが有効な時、レコード型の定義は意味を変えます。

source: With this option on, when a unification fails, typeclass resolution is tried before launching unification once again.
ja: このオプションが有効なことにより、単一化が失敗したとき、再度単一化を起動する前に型クラス解決が試行されます。

source: You can override the display format for specified types by adding entries to these tables:
ja: これらの表にエントリを追加することで特定の型の表示形式を上書きすることが出来ます。

source: ``Pack`` is a notation, hence it is not type checked at the time of its declaration.
ja: ``Pack`` は記法であり、従ってその定義時点では型検査されません。

source: ``Structure`` is a synonym of the keyword ``Record``.
ja: ``Structure`` はキーワード ``Record`` の別名です。

source: ``debug`` In debug mode, the trace of successfully applied tactics is printed.
ja: ``debug`` デバッグモードでは、成功裏に適用されたタクティックのトレースが表示されます。

source: ``depth`` This sets the depth limit of the search.
ja: ``depth`` これはその検索の深さ制限を設定します。

source: ``dfs, bfs`` This sets the search strategy to depth-first search (the default) or breadth-first search.
ja: ``dfs, bfs`` これは検索戦略を深さ優先探索 (デフォルト) または幅優先探索に設定します。

source: ``typeclasses eauto`` is a multi-goal tactic.
ja: ``typeclasses eauto`` はマルチゴールタクティックです。

source: ``{measure`` `term` `ident` ``}`` with `ident` being the decreasing argument and `term` being a function from type of `ident` to ``nat`` for which value on the decreasing argument decreases (for the ``lt`` order on ``nat``) at each recursive call of `term`.
ja: ``{measure`` `term` `ident` ``}`` ここで `ident` は減少する引数であり、`term` は `ident` の型から ``nat`` への関数であり、その減少引数上の値は `term` の再帰呼び出し毎に減少します (``nat`` 上なら ``lt`` 順序に沿って)。

source: ``{wf`` `term` `ident` ``}`` with `ident` being the decreasing argument and `term` an ordering relation on the type of `ident` (i.e. of type `T`\ :math:`_{\sf ident}` → `T`\ :math:`_{\sf ident}` → ``Prop``) for which the decreasing argument decreases at each recursive call of `term`.
ja: ``{wf`` `term` `ident` ``}`` ここで `ident` は減少する引数であり、`term` は `ident` の型上の順序関係 (i.e. `T`\ :math:`_{\sf ident}` → `T`\ :math:`_{\sf ident}` → ``Prop`` という型) であり、その減少引数は `term` の再帰呼び出し毎に減少します。

source: `functional inversion` will not be available for the function.
ja: その関数についての `functional inversion` が使えるようになりません。

source: `ident_complete` and `ident_correct` which are inversion information linking the function and its graph.
ja: `ident_complete` と `ident_correct` は関数とそのグラフを紐付ける反転情報です。

source: `ident_rect`, `ident_rec` and `ident_ind`, which reflect the pattern matching structure of `term` (see :cmd:`Inductive`);
ja: `ident_rect` と `ident_rec` と `ident_ind` は `term` (:cmd:`Inductive` 参照) のパターンマッチ構造を反映します;

source: in which case the correctness of :n:`@type₃` may rely on the instance :n:`@term₂` of :n:`@ident₂` and :n:`@term₂` may in turn depend on :n:`@ident₁`.
ja: この場合 :n:`@type₃` の正しさは :n:`@ident₂` のインスタンスである :n:`@term₂` に依存し、:n:`@term₂` は :n:`@ident₁` に依存するかもしれません。

source: than like this:
ja: これより良いでしょう:

source: the definition is not a *pattern matching tree* as explained above.
ja: その定義は上で説明したような *パターンマッチングツリー* ではありません。

source: the definition uses pattern matching on dependent types, which ``Function`` cannot deal with yet.
ja: その定義は依存型上のパターンマッチを使っており、``Function`` はまだそれを扱うことができません。

source: the first identifier :token:`ident` is the name of the defined record and :token:`sort` is its type.
ja: 最初の識別子 :token:`ident` は定義されたレコードの名前であり、:token:`sort` はその型です。

source: |Coq| also provides an interactive proof assistant to build proofs using specific programs called *tactics*.
ja: また、|Coq| は、 *タクティック* と呼ばれるプログラムを用いて証明を構築する、対話的証明アシスタントも提供します。

source: |Gallina| is the kernel language of |Coq|.
ja: |Gallina| は |Coq| の核言語です。

source: |term_0| must be built as a *pure pattern matching tree* (:g:`match … with`) with applications only *at the end* of each branch.
ja: |term_0| は 各ブランチの *末尾* のみで適用される *純粋パターンマッチングツリー* (:g:`match … with`) として構築されなければなりません。
